src/main/test/supply-chain/1-Grouping/0-Apply Tax/1-02_02_UNSPSC-Grouping/23-TC02.02.24_Grouping_UNSPSC_4items_GAException_mixed_CAR_SER/0-TC02.02.24_01_Grouping_UNSPSC_4items_GAException_mixed_CAR_SER/request.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:ws="http://ws.tim.ikea.com/">
   <soap:Header/>
   <soap:Body>
      <ws:applyTax>
  <arg0><DocumentId>
    <SystemSourceId>COMPASS001</SystemSourceId>
    <TransactionId/>
  </DocumentId>
  <AlternateDocumentId>
    <CustomField1>CustomField1</CustomField1>
    <CustomField2/>
    <CustomField3/>
    <CustomField4/>
    <CustomField5/>
    <CustomField6/>
    <CustomField7/>
    <CustomField8/>
    <CustomField9/>
    <CustomField10/>
  </AlternateDocumentId>
  <InvoiceLanguage>
    <LanguageCode>en</LanguageCode>
    <LanguageCountryCode>GB</LanguageCountryCode>
  </InvoiceLanguage>
  <CommunicationLanguage>
    <LanguageCode>en</LanguageCode>
    <LanguageCountryCode>GB</LanguageCountryCode>
  </CommunicationLanguage>
  <CalculationDecimalPlaces>0</CalculationDecimalPlaces>
  <PreviousInvoiceTaxCountry/>
  <TaxDecisionSet>
    <TaxDecisionSetId/>
    <SellerTaxIndicator>
      <TaxIndicatorAbbreviation/>
      <TaxIndicatorName/>
      <TaxIndicatorComment/>
    </SellerTaxIndicator>
    <SellerTaxCountry/>
    <SellerTaxState/>
    <BuyerTaxIndicator>
      <TaxIndicatorAbbreviation/>
      <TaxIndicatorName/>
      <TaxIndicatorComment/>
    </BuyerTaxIndicator>
    <BuyerTaxCountry/>
    <BuyerTaxState/>
    <CombinedTaxIndicator/>
    <CommercialIndicator/>
    <SellerTaxRegCountry/>
    <SellerTaxRegState/>
    <BuyerTaxRegCountry/>
    <BuyerTaxRegState/>
    <SellerTaxTotal>
      <NetAmount/>
      <TaxAmount/>
      <GrossAmount/>
      <TaxAmountInLocalCurrency/>
      <TaxInvoiceSubTotal>
        <TaxType>
          <TaxTypeName/>
          <TaxTypeAbbreviation/>
          <TaxTypeDescription/>
        </TaxType>
        <TaxCode/>
        <TaxRate/>
        <NetAmount/>
        <TaxAmount/>
        <GrossAmount/>
        <TaxAmountInLocalCurrency/>
      </TaxInvoiceSubTotal>
    </SellerTaxTotal>
    <BuyerTaxTotal>
      <NetAmount/>
      <TaxAmount/>
      <GrossAmount/>
      <TaxAmountInLocalCurrency/>
      <TaxInvoiceSubTotal>
        <TaxType>
          <TaxTypeName/>
          <TaxTypeAbbreviation/>
          <TaxTypeDescription/>
        </TaxType>
        <TaxCode/>
        <TaxRate/>
        <NetAmount/>
        <TaxAmount/>
        <GrossAmount/>
        <TaxAmountInLocalCurrency/>
      </TaxInvoiceSubTotal>
    </BuyerTaxTotal>
    <TaxComment>
      <TaxCommentType/>
      <TaxCommentText/>
    </TaxComment>
    <InvoiceCurrency>
      <CurrencyCode>EUR</CurrencyCode>
      <SellerLocalTaxCurrencyExchangeRate/>
      <SellerLocalTaxCurrencyCode/>
      <BuyerLocalTaxCurrencyExchangeRate/>
      <BuyerLocalTaxCurrencyCode/>
    </InvoiceCurrency>
    <LegalTaxCalculationLevel>G</LegalTaxCalculationLevel>
    <TaxInvoiceLine>
      <LineNumber>1</LineNumber>
      <ItemNo>1</ItemNo>
      <ItemType/>
      <UNSPSC>78000000</UNSPSC>
      <Classification/>
      <SubClassification/>
      <CountryItemClassification/>
      <NetAmount>50.0</NetAmount>
      <SellerTax/>
       <VariableTaxSteeringInput>
    <ConsignorCountry/>
    <ConsignorState/>
    <ConsignorBusinessUnitCode/>
    <ConsignorBusinessUnitType/>
    <ConsigneeCountry/>
    <ConsigneeState/>
    <ConsigneeBusinessUnitCode/>
    <ConsigneeBusinessUnitType/>
    <CarrierCountry>CA</CarrierCountry>
    <CarrierState>CAON</CarrierState>
    <CarrierBusinessUnitCode/>
    <CarrierBusinessUnitType/>
    <ShipmentStartCountry/>
    <ShipmentEndCountry/>
    <ShipmentStartState/>
    <ShipmentEndState/>
    <ServiceRenderedCountry/>
    <ServiceRenderedState/>
    
    <ShippingOfCustomsClearedGoods/>
  </VariableTaxSteeringInput>  
      <BuyerTax/>
        
    </TaxInvoiceLine>
     <TaxInvoiceLine>
      <LineNumber>2</LineNumber>
      <ItemNo>2</ItemNo>
      <ItemType/>
      <UNSPSC>78000000</UNSPSC>
      <Classification/>
      <SubClassification/>
      <CountryItemClassification/>
      <NetAmount>50.0</NetAmount>
      <SellerTax/>
  <VariableTaxSteeringInput>
    <ConsignorCountry/>
    <ConsignorState/>
    <ConsignorBusinessUnitCode/>
    <ConsignorBusinessUnitType/>
    <ConsigneeCountry/>
    <ConsigneeState/>
    <ConsigneeBusinessUnitCode/>
    <ConsigneeBusinessUnitType/>
    <CarrierCountry>CA</CarrierCountry>
    <CarrierState>CAQC</CarrierState>
    <CarrierBusinessUnitCode/>
    <CarrierBusinessUnitType/>
    <ShipmentStartCountry/>
    <ShipmentEndCountry/>
    <ShipmentStartState/>
    <ShipmentEndState/>
    <ServiceRenderedCountry/>
    <ServiceRenderedState/>
    
    <ShippingOfCustomsClearedGoods/>
  </VariableTaxSteeringInput>  
 
   
        
    </TaxInvoiceLine>
     <TaxInvoiceLine>
      <LineNumber>3</LineNumber>
      <ItemNo>3</ItemNo>
      <ItemType/>
      <UNSPSC>78000000</UNSPSC>
      <Classification/>
      <SubClassification/>
      <CountryItemClassification/>
      <NetAmount>50.0</NetAmount>
     
  <VariableTaxSteeringInput>
    <ConsignorCountry/>
    <ConsignorState/>
    <ConsignorBusinessUnitCode/>
    <ConsignorBusinessUnitType/>
    <ConsigneeCountry/>
    <ConsigneeState/>
    <ConsigneeBusinessUnitCode/>
    <ConsigneeBusinessUnitType/>
    <CarrierCountry>CA</CarrierCountry>
    <CarrierState>CAAB</CarrierState>
    <CarrierBusinessUnitCode/>
    <CarrierBusinessUnitType/>
    <ShipmentStartCountry/>
    <ShipmentEndCountry/>
    <ShipmentStartState/>
    <ShipmentEndState/>
    <ServiceRenderedCountry/>
    <ServiceRenderedState/>
    
    <ShippingOfCustomsClearedGoods/>
  </VariableTaxSteeringInput>  
 
     
        
    </TaxInvoiceLine>
     <TaxInvoiceLine>
      <LineNumber>4</LineNumber>
      <ItemNo>4</ItemNo>
      <ItemType/>
      <UNSPSC>20100000</UNSPSC>
      <Classification/>
      <SubClassification/>
      <CountryItemClassification/>
      <NetAmount>50.0</NetAmount>
     
        <VariableTaxSteeringInput>
    <ConsignorCountry/>
    <ConsignorState/>
    <ConsignorBusinessUnitCode>1203</ConsignorBusinessUnitCode>
    <ConsignorBusinessUnitType>COM</ConsignorBusinessUnitType>
    <ConsigneeCountry/>
    <ConsigneeState/>
    <ConsigneeBusinessUnitCode>5501</ConsigneeBusinessUnitCode>
    <ConsigneeBusinessUnitType>COM</ConsigneeBusinessUnitType>
    <CarrierCountry>DE</CarrierCountry>
    <CarrierState/>
    <CarrierBusinessUnitCode/>
    <CarrierBusinessUnitType/>
    <ShipmentStartCountry/>
    <ShipmentEndCountry/>
    <ShipmentStartState/>
    <ShipmentEndState/>
    <ServiceRenderedCountry/>
    <ServiceRenderedState/>
    
    <ShippingOfCustomsClearedGoods/>
  </VariableTaxSteeringInput>  
 
     
        
    </TaxInvoiceLine>
   
  </TaxDecisionSet>
  <TaxDate>
    <TaxAlgorithmDate>2014-05-12</TaxAlgorithmDate>
    <TaxCalculationDate/>
  </TaxDate>
  <TaxModuleBehaviour>
    <SkipCalculation>Y</SkipCalculation>
    <SkipDecision>N</SkipDecision>
  </TaxModuleBehaviour>
   <VariableTaxSteeringInput>
    <ConsignorCountry/>
    <ConsignorState/>
    <ConsignorBusinessUnitCode>1203</ConsignorBusinessUnitCode>
    <ConsignorBusinessUnitType>COM</ConsignorBusinessUnitType>
    <ConsigneeCountry/>
    <ConsigneeState/>
    <ConsigneeBusinessUnitCode>5501</ConsigneeBusinessUnitCode>
    <ConsigneeBusinessUnitType>COM</ConsigneeBusinessUnitType>
    <CarrierCountry/>
    <CarrierState/>
    <CarrierBusinessUnitCode/>
    <CarrierBusinessUnitType/>
    <ShipmentStartCountry/>
    <ShipmentEndCountry/>
    <ShipmentStartState/>
    <ShipmentEndState/>
    <ServiceRenderedCountry/>
    <ServiceRenderedState/>
     
    <ShippingOfCustomsClearedGoods/>
  </VariableTaxSteeringInput>  
  <BuyerParty>
    <Party>
      <BusinessUnitCode>1203</BusinessUnitCode>
      <BusinessUnitType>COM</BusinessUnitType>
      <BusinessUnitName/>
    
      <PartyAddress>
        <AddressType/>
        <City/>
        <PostBox/>
        <Street/>
        <ZipCode/>
        <CountryCode/>
        <StateCode/>
        <CountryOfLegalRegistration/>
      </PartyAddress>
    </Party>
    
  </BuyerParty>
  <SellerParty>
    <Party>
      <BusinessUnitCode>5501</BusinessUnitCode>
      <BusinessUnitType>COM</BusinessUnitType>
      <BusinessUnitName/>
     
      <PartyAddress>
        <AddressType/>
        <City/>
        <PostBox/>
        <Street/>
        <ZipCode/>
        <CountryCode/>
        <StateCode/>
        <CountryOfLegalRegistration/>
      </PartyAddress>
    </Party>
    
  </SellerParty>
  <TermOfDelivery>DDU</TermOfDelivery></arg0></ws:applyTax>
   </soap:Body>
</soap:Envelope>